cases/chpt2-Ga-Melt-Bench/system/blockMeshDict
  /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices //-0.02
(
    (0 -2 0)
    (8.89 -2 0)
    (8.89 2 0)
    (0 2 0)
    (0 -2 6.35)
    (8.89 -2 6.35)
    (8.89 2 6.35)
    (0 2 6.35)

);
/*
vertices
(
    (0 -0.2 0)
    (6.35 -0.2 0)
    (6.35 0.2 0)
    (0 0.2 0)
    (0 -0.2 8.89)
    (6.35 -0.2 8.89)
    (6.35 0.2 8.89)
    (0 0.2 8.89)

);
//*/

blocks
(
//    hex (0 1 2 3 4 5 6 7) allZone (42 1 32) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) allZone (63 1 48) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) allZone (84 1 64) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) allZone (105 1 80) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) allZone (210 1 160) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    hot
    {
        type patch;
        faces
        (
        (0 4 7 3)        
        );
    }
    cold
    {
        type wall;
        faces
        (
        (2 6 5 1)
        );
    }
    top
    {
        type wall;
        faces
        (
        (4 5 6 7)
        );
    }
    btm
    {
        type wall;
        faces
        (
        (0 3 2 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
        (3 7 6 2)
        (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
