cases/chpt2-Ga-Melt-Bench/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    hot
    {
        type            patch;
        nFaces          64;
        startFace       10604;
    }
    cold
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       10668;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       10732;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       10816;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10752;
        startFace       10900;
    }
)

// ************************************************************************* //
