cases/chpt2-Ga-Melt-Bench/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This is for gallium in cavity

phaseChange 1.0;

phases (Phase1 Phase2);

phaseChangeTwoPhaseMixture Weld;

pSat            0;   // Saturation pressure
pMin            0; 

sigma           0;//.025;//.05;//.01;//.3;//0.07;

//k k [1 1 -3 1 0 0 0] 1; // kg*m/s^3*k
k 0;
k1 32;//24; //24 liquid, 40 solid?
k2  32;//40;//40;
k_weld 0;//40; 

multiplierBuoy 5e9;
sourceTime 0;

dmdtRelaxAlpha 2.5; // 5 is a touch high
dmdtRelaxPressure 0;

testFudge 1;

dsigmadT 0;

meltingT 302.93;

cp cp [0 2 -2 -1 0 0 0] 381.5;

//rhoRef rhoRef [1 -3 0 0 0 0 0] 6095;
rhoRef 6.093e3;

htot htot [1 -1 -2 0 0 0 0] 1;

Lf 80160; //80.16 kJ/kg

//Tref 302.93; // 29.78 C
Tref 302.78;

beta 1.2e-4;

Phase1 // liquid
{
    transportModel  Newtonian;
//    nu              2.97e-07; // mu = 1.81e-3 // is this for Sn??
//    nu              2.26e-07;
    nu              2.97e-07;
    rho             6093;//6100;
}

Phase2 // solid
{
    transportModel  Newtonian;
//    nu              2.26e-07;
//    rho             6093;
//    nu              3.06e-07;
//    rho             5910; // 5.91 g/cm^3 less tham liquid;
    nu              2.97e-07;
    rho             6093;//6100;
}

KunzCoeffs
{
    UInf            U20.0;
    tInf            t0.005; // L = 0.1 m
    Cc              C1000;
    Cv              C1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

WeldCoeffs
{
    UInf            1;
    tInf            1;  // L = 0.1 m
    Cc              1;
    Cv              1;
    Tmelt           302.93; //302.93; // 1940; // ti-6-4
    Tzero           0;
    Tone            1;
    Tmone           -1;
    kgOne           1;
    Mone            1;
    tOne            1;
    test            0;
    Cp              381.5;
    Lf              80160;
}


SchnerrSauerCoeffs
{
    n               1.6e+13;
    dNuc            2.0e-06;
    Cc              1;
    Cv              1;
}


// ************************************************************************* //
