cases/chpt2-Ga-Melt-Bench/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

//internalField   uniform 301.45; // 28.3 C
internalField   uniform 301.3; // 28.3 C

boundaryField
{
    hot
    {
      type   fixedValue;
//      value uniform 311.15; // 38 C
        value uniform 311;
    } 
    top
    {
      type   zeroGradient; // adiabatic
      value           $internalField;
    }
    btm
    {
      type   zeroGradient; // adiabatic
      value           $internalField;
    }
    cold
    {
//      type   fixedValue;
//      value uniform 301.45; // 28.3 C
        type           inletOutlet;
        inletValue     $internalField;
        value          $internalField;
    }
    frontAndBack
    {
        type empty;
    }
}           

// ************************************************************************* //
