cases/chpt2-Ga-Melt-Bench/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//    default             CrankNicolson 1;
    default         Euler;
}

interpolationSchemes
{
    default             linear;
}

divSchemes
{
    default                     Gauss linear;
    div(rhoPhi,U)               Gauss vanLeer;
    div(phi,alpha)              Gauss vanLeer;
    div(phi,alpha.Phase1)       Gauss vanLeer;
    div(phirb,alpha)            Gauss vanLeer;
    div(rhoPhiCp,T)             Gauss vanLeer;
//    div(rhoPhiCp,T)             Gauss linearUpwind grad(T);
    div(phi,T)                  Gauss upwind;
}

gradSchemes
{
    default             Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

snGradSchemes
{
//    default             orthogonal;
    default         corrected;
}

// ************************************************************************* //
