cases/chpt2-Ga-Melt-Bench/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//    "B"
    ElPot
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.05;
    };
    ElPotFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.05;
    };
    /*
    ElPot
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0;
    };
    ElPotFinal
    {   
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-05;//8;
        relTol           0;
    };
    */
    A
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0;
    };
    AFinal
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-08;
        relTol           0;
    };
/*
    T
    {
        solver          GAMG;
//        smoother        DILUGaussSeidel;
        smoother        GaussSeidel;
        tolerance       1.0e-6;
        relTol          0.0001;
        minIter         10;
    };
    TFinal
    {
        solver          GAMG;
//        smoother        DILUGaussSeidel;
        smoother        GaussSeidel;
        tolerance       1.0e-6;
        relTol          0.0001;
        minIter         10;
    };
    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1.0e-8;//6;
        relTol          0.0;//001;
//        minIter         3;
    };
    TFinal
    {
        $T;
        relTol 0;
    }
*/
    /*
    */

    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
//        tolerance       1e-06;
        tolerance       1e-04;
        relTol          0;
    }
    TFinal
    {
//        smoother        DILU;
        $T;
    }

    "alpha.Phase*.*"
    {
        cAlpha          2;
        nAlphaCorr      1;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    10;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
//        maxIter         10;
    };

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    };

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

/*
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }
    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0.02;
        //maxIter         0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
*/
/*
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;

        smoother        DICGaussSeidel;



        maxIter         10;
    };

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance       1e-6;
            relTol          0;

            nVcycles        2;

            smoother        DICGaussSeidel;

        };
        tolerance       1e-7;
        relTol          0;
        maxIter         10;
    };

    "pcorr.*"
    {
        $p_rgh;
        relTol          0;
    };
*/
    Phi
    {
        $p_rgh;
        relTol          0;
    };

    B
    {
        nBCorr          3;
    };
}

potentialFlow
{
    nNonOrthogonalCorrectors   3;
}

PIMPLE
{
    momentumPredictor           yes;
    nOuterCorrectors            1;//1;
    nCorrectors                 3;//3;
    nNonOrthogonalCorrectors    0;

//    pRefCell       0;//      (0 0 0);
//    pRefValue      0;
}

relaxationFactors
{
    /*
    equations
    {
        "U.*"                   0.5;
        "p_rgh"                 0.6;
        "T"                     0.9;
    }
    */
}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
}

BPISO
{
    nCorrectors     3;
}


ElPot
{
    nCorrectors 0;
    nNonOrthogonalCorrectors 0;
    ElPotRefCell 0;
    ElPotRefValue 0;
}


// ************************************************************************* //
